# 판다스

판다스 개요.
금융 데이터 분석을 위해 2008년 wes mckinney 가 설계함.
구조화된 데이터를 빠르고 쉬움면서 다양한 형식으로 가공할 수 있는 풍부한 자료 구조와 함수를 제공.
pandas의 구조는 numpy

판다스 특징
빅데이터 분석에 최적화 된 필수 패키지
데이터는 시계열 또는 표의 형태
표 데이터를 다루기 위한 시리즈 클래스 변환

In [1]:
import pandas as pd

시리즈 클래스
시리즈 클래스는 numpy 에서 제공하는 1차원 배열과 비슷하지만 각 데이터의 의미를
표시하는 인덱스를 붙일 수 있다. 데이터 자체는 값(value)라고 한다.
시리즈 = 값 + 인덱스

시리즈 개요
데이터를 리스트나 1차원 배열 형식으로 series 클래스 생성자에 넣어주면 시리즈 클래스 객체를 만들 수 있다.

In [4]:
obj = pd.Series([4,5,-2,8])
# 시리즈의 s는 대문자로 표시한다.
obj

0    4
1    5
2   -2
3    8
dtype: int64

In [6]:
# 시리즈 확인하기 
obj.values

array([ 4,  5, -2,  8], dtype=int64)

In [11]:
obj.index
# 시리즈의 인덱스만 확인하기.

RangeIndex(start=0, stop=4, step=1)

In [12]:
obj.dtypes
#시리즈의 자료형 확인하기.

dtype('int64')

시리즈 인덱스

인덱스의 길이는 데이터의 길이와 같아야한다. 인덱스의 값을 인덱스 라벨이라고도 한다.  
인덱스 라벨은 문자열 뿐 아니라 날짜, 시간,정수 등도 가능하다.

In [16]:
obj2 = pd.Series([4,5,-2,8],index=["a","b","c","d"])
obj2
# 인덱스로 인해 a,b,c 출력과 4,5,-2가 나온다.

a    4
b    5
c   -2
d    8
dtype: int64

시리즈와 딕셔너리 자료형

In [20]:
data ={"kim":35000,"park":667000,"joon":2353,"choi":4000}
obj3 = pd.Series(data)
obj3

kim      35000
park    667000
joon      2353
choi      4000
dtype: int64

In [21]:
obj3.name = "Salary"
obj3.index.name = "Names"
obj3
# 시리즈 전체를 샐러리로 만들고 kim이 있는 인덱스의 네임값을 '네임' 이라 준다.

Names
kim      35000
park    667000
joon      2353
choi      4000
Name: Salary, dtype: int64

In [23]:
obj3.index=["A","b","C","D"]
obj3.index.name = 'sarada'
obj3

sarada
A     35000
b    667000
C      2353
D      4000
Name: Salary, dtype: int64

In [24]:
# 시리즈 연산
# numpy 배열 처럼 시리즈도 벡터화 연산가능
# 시리즈의 값엠나 적용되며 인덱스 값은 변하지 않는다.

In [25]:
obj*10
# vlaue 값 * 10이 된다.

0    40
1    50
2   -20
3    80
dtype: int64

In [27]:
obj*obj
# obj끼리의 곱.

0    16
1    25
2     4
3    64
dtype: int64

In [28]:
obj.values + obj.values

array([ 8, 10, -4, 16], dtype=int64)

# 시리즈 인덱싱(생략)

시리즈의 데이터 갱신, 추가,삭제  
인덱싱을 이용하여 딕셔너리처럼 데이터를 갱신하거나 추가  
데이터 삭제 시 딕셔너리 처럼 del 명령 사용

# pandas 데이터 프레임

데이터 프레임 개요  
+ 시리즈가 1차원 백터 데이터에 행 방향 인덱스이라면  
+ 데이터프레임 클래스는 2차원 행렬 데이터에 합친 것으로  
+ 행 인덱스 와 열 인덱스를 지정

### 데이터 프레임 생성

데이터 프레임 생성
+ 우선 하나의 열이 되는 데이터를 리스트나 일차원 배열을 준비
+ 각 열에 대한 이름의 키를 갖는 딕셔너리를 생성
+ 판다스의 데이터 프레임 클래스로 생성.

In [31]:
#데이터 프레임은 파이썬의 딕셔너리 또는 넘파이의 어레이로 정의

data={'name':["choi","choi","choi","kim","park"],
      'year':[2013,2014,2015,2016,2017],
       'points':[1.5,1.7,3.6,2.4,2.9]
     }
df = pd.DataFrame(data)
df
# name year points 는 각 이름을 준다. 나머지는 순서대로 값이 들어가게 나열.

   name  year  points
0  choi  2013     1.5
1  choi  2014     1.7
2  choi  2015     3.6
3   kim  2016     2.4
4  park  2017     2.9

In [38]:
df.index
# 행 방향의 인덱스 확인 ||||||

RangeIndex(start=0, stop=5, step=1)

In [39]:
df.columns
# 열 방향의 인덱스 확인.-----

Index(['name', 'year', 'points'], dtype='object')

In [41]:
df.values
# 데이터 값 출력.

array([['choi', 2013, 1.5],
       ['choi', 2014, 1.7],
       ['choi', 2015, 3.6],
       ['kim', 2016, 2.4],
       ['park', 2017, 2.9]], dtype=object)

데이터 프레임 열(colums)
데이터 프레임 열 갱신 추가

+ 데이터 프레임은 열 시리즈의 딕셔너리로 볼 수 있으므로 열 단위로 데이터를 갱신하거나 추가, 삭제  
+ data에 포함되어 있지 않은 값은 nan( not a number ) 으로 나타내는 null과 같은 개념

In [43]:
df = pd.DataFrame(data, columns=["year","name","points","penalty"],
                 index=(["one","two","three","four","five"]))
df

       year  name  points penalty
one    2013  choi     1.5     NaN
two    2014  choi     1.7     NaN
three  2015  choi     3.6     NaN
four   2016   kim     2.4     NaN
five   2017  park     2.9     NaN

In [45]:
df[["year","points"]]
# 컬럼스 입력한 값과 인덱스 값이 동시에 나온다.

       year  points
one    2013     1.5
two    2014     1.7
three  2015     3.6
four   2016     2.4
five   2017     2.9

In [46]:
df["year"]
# 하나만 입력하면 시리즈가 호출된다.

one      2013
two      2014
three    2015
four     2016
five     2017
Name: year, dtype: int64

In [48]:
df["penalty"] = 0.5
df
# penalty 열에 다른행값 을 추가하고 싶을때.

       year  name  points  penalty
one    2013  choi     1.5      0.5
two    2014  choi     1.7      0.5
three  2015  choi     3.6      0.5
four   2016   kim     2.4      0.5
five   2017  park     2.9      0.5

In [49]:
df["penalty"]=[0.1,0.2,0.3,0.4,0.5]
df

       year  name  points  penalty
one    2013  choi     1.5      0.1
two    2014  choi     1.7      0.2
three  2015  choi     3.6      0.3
four   2016   kim     2.4      0.4
five   2017  park     2.9      0.5

In [50]:
df["year"]

one      2013
two      2014
three    2015
four     2016
five     2017
Name: year, dtype: int64

In [51]:
df.year

one      2013
two      2014
three    2015
four     2016
five     2017
Name: year, dtype: int64

In [59]:
df[['year','name']]

       year  name
one    2013  choi
two    2014  choi
three  2015  choi
four   2016   kim
five   2017  park

In [60]:
import numpy as np

In [62]:
df['penalty'] = np.arange(5)

In [63]:
df.penalty

one      0
two      1
three    2
four     3
five     4
Name: penalty, dtype: int32

In [67]:
df["zeros"]=np.arange(5)
df
# 새로운 칼럼을 추가하고 싶을때.

       year  name  points  penalty  zeros
one    2013  choi     1.5        0      0
two    2014  choi     1.7        1      1
three  2015  choi     3.6        2      2
four   2016   kim     2.4        3      3
five   2017  park     2.9        4      4

In [69]:
val =pd.Series([-1.2,-1.5,-1.7],index=["two","four","five"])
df["debt"]=val
df
# 새로운 행을 만들면서 2,4,5 행의 값에만 시리즈로 주어진 값이 들어간다.

       year  name  points  penalty  zeros  debt
one    2013  choi     1.5        0      0   NaN
two    2014  choi     1.7        1      1  -1.2
three  2015  choi     3.6        2      2   NaN
four   2016   kim     2.4        3      3  -1.5
five   2017  park     2.9        4      4  -1.7

In [72]:
df["net_points"] = df["points"] - df["penalty"]
# 넷포인트라는 열을 추가하고 조건을 주어서 값을 구한다.

In [74]:
df["high_ponts"] = df["net_points"]>2.0
df
# 조건을 주어서 true false 값을 구하기.

       year  name  points  penalty  zeros  debt  net_points  high_ponts
one    2013  choi     1.5        0      0   NaN         1.5       False
two    2014  choi     1.7        1      1  -1.2         0.7       False
three  2015  choi     3.6        2      2   NaN         1.6       False
four   2016   kim     2.4        3      3  -1.5        -0.6       False
five   2017  park     2.9        4      4  -1.7        -1.1       False

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, one to five
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   year        5 non-null      int64
 1   name        5 non-null      object
 2   points      5 non-null      float64
 3   penalty     5 non-null      int32
 4   zeros       5 non-null      int32
 5   debt        3 non-null      float64
 6   net_points  5 non-null      float64
 7   high_ponts  5 non-null      bool
dtypes: bool(1), float64(3), int32(2), int64(1), object(1)
memory usage: 445.0+ bytes

In [78]:
df['zeros'] = df['zeros'].astype(str) + '점'
# 판다스에 글자를 넣어서 출력할대 할 수 있는 함수.
df

       year  name  points  penalty zeros  debt  net_points  high_ponts
one    2013  choi     1.5        0    0점   NaN         1.5       False
two    2014  choi     1.7        1    1점  -1.2         0.7       False
three  2015  choi     3.6        2    2점   NaN         1.6       False
four   2016   kim     2.4        3    3점  -1.5        -0.6       False
five   2017  park     2.9        4    4점  -1.7        -1.1       False

In [85]:
df['nickname'] = df.name + '' + df.zeros
df

,year,name,points,penalty,zeros,debt,net_points,high_ponts,nickname
one,2013,choi,1.5,0,0점,NaN,1.5,False,choi0점
two,2014,choi,1.7,1,1점,-1.2,0.7,False,choi1점
three,2015,choi,3.6,2,2점,NaN,1.6,False,choi2점
four,2016,kim,2.4,3,3점,-1.5,-0.6,False,kim3점
five,2017,park,2.9,4,4점,-1.7,-1.1,False,park4점

데이터 프레임 열
삭제하기

In [88]:
del df["zeros"]
df

       year  name  points  penalty  debt  net_points  high_ponts nickname
one    2013  choi     1.5        0   NaN         1.5       False   choi0점
two    2014  choi     1.7        1  -1.2         0.7       False   choi1점
three  2015  choi     3.6        2   NaN         1.6       False   choi2점
four   2016   kim     2.4        3  -1.5        -0.6       False    kim3점
five   2017  park     2.9        4  -1.7        -1.1       False   park4점

In [90]:
del df["net_points"]

In [91]:
del df["high_ponts"]

In [92]:
df

       year  name  points  penalty  debt nickname
one    2013  choi     1.5        0   NaN   choi0점
two    2014  choi     1.7        1  -1.2   choi1점
three  2015  choi     3.6        2   NaN   choi2점
four   2016   kim     2.4        3  -1.5    kim3점
five   2017  park     2.9        4  -1.7   park4점

In [93]:
del df['nickname']

In [94]:
df

       year  name  points  penalty  debt
one    2013  choi     1.5        0   NaN
two    2014  choi     1.7        1  -1.2
three  2015  choi     3.6        2   NaN
four   2016   kim     2.4        3  -1.5
five   2017  park     2.9        4  -1.7

In [98]:
df.drop(['debt','penalty'], axis =1, inplace =True)
# 두가지를 동시에 지우고 싶을때. axis =1 inplace의 트루.폴스 값을 통하여 원본에 영향을 끼칠건지 선택.

KeyError: "['debt' 'penalty'] not found in axis"

In [99]:
df

       year  name  points
one    2013  choi     1.5
two    2014  choi     1.7
three  2015  choi     3.6
four   2016   kim     2.4
five   2017  park     2.9